[
    {
        "job title": "Completion & Well Intervention Engineer",
        "company_name": "Shell",
        "company_location": "Warri",
        "job type": " ",
        "job content": "What’s the role?\nResponsible for the design, planning, and management of completion and well intervention operations, with the full integration of the CWI Operations team and relevant asset teams. Preparation of detailed cost and time estimates, tracking of relevant metrics during job execution, after action reviews (AAR) documentation, well handover to production, and developing subsequent improvement plans.\nAccountabilities:\nProject Design/Execution: Deliver world-class design/execution performance by embedding continuous improvement methodology as the way of working and implementing full use of the Global Well Delivery Process (GWDP)\nHSSE – Integrate HSSE in the design, programming, and execution of well work on completion and well intervention operations. Actively promote HSSE and Sustainable Development (SD) in all activities and ensure compliance with business principles. Lead the technical and HSSE management of relevant service provider contracts and support the contracting and procurement strategy. Collaborate with contractors regarding performance, future plans, variances, etc. as needed.\nRegulatory – ensure all Well Notifications, Combined Operations Notifications, Regulatory Permits, etc are all in place and correct prior to commencement of operations\nSupport and foster relationships with other asset teams including subsurface, production, facilities, and construction. Support engagements with JV partners where applicable and the development and analysis of competitive benchmarking to drive operational excellence. Mentor junior staff in all aspects of completion engineering design and operations, and in interaction with other asset teams\nDesign Completions & Well Interventions activities, sit within the execution teams for Completion & Well Interventions to deliver planned scope. Supervise and ensure Completion & Well Intervention programmes are executed safely and efficiently and that all company policies and procedures are fully adhered to.\nMonitor offshore LWIV based Completion & Well Intervention operations. Ensure accurate reporting of all Completion & Well Intervention activities into the approved reporting medium.\nImplement accurate cost monitoring of all Completion & Well Intervention activities both in the office and on the well site. Integrate and liaise with other disciplines to ensure efficient and effective execution of Completion & Well Intervention work programmes.\nWhat we need from you?\nA professional Engineer with a university degree in a relevant engineering or science discipline.\nMinimum of five (5) and not more than Eight (8) years’ experience in Completions and Well intervention design and operations.\nIWCF/WIPC certification will be an added advantage\nGood supervisory skills, with sound knowledge of Completions and Intervention practices\nStrong interpersonal skills\nGood analytical, communication and writing skills, with PC fluency and familiarity with drilling engineering software.\nExcellent proficiency in English language, both in speech and in writing.\nWilling to work on rotations to field locations\nScam Warning\nShell does not request monetary payments (e.g. insurance policy, visa/work permit, HUET or HSSE training, special job offer, etc.) for employment. Individuals who are interested in opportunities within the Shell Group will find open positions listed on the company websites www.shell.com/careers when available.\nShell does not make use of employment forms; neither does the Company process CVs that have not been submitted through the proper websites: www.shell.com/careers. All successful applicants who receive an offer of employment from Shell would have been required to go through a formal and transparent recruitment process.\nTo learn more about Shell’s recruitment process please visit our website www.shell.com/careers.\nShell is an Equal Opportunity Employer.\nCOMPANY DESCRIPTION\nAn innovative place to work\nThere’s never been a more exciting time to work at Shell. Everyone here is helping solve one of the biggest challenges facing the world today: bringing the benefits of energy to everyone on the planet, whilst managing the risks of climate change.\nJoin us and you’ll add your talent and imagination to a business with the power to shape the future – whether by investing in renewables, exploring new ways to store energy or developing technology that helps the world to use energy more efficiently.\nAn inclusive place to work\nTo power progress together, we need to attract and develop the brightest minds and make sure every voice is heard. Here are just some of the ways we’re nurturing an inclusive environment – one where you can express your ideas, extend your skills and reach your potential…\nWe’re creating a space where people with disabilities can excel through transparent recruitment process, workplace adjustments and ongoing support in their roles. Feel free to let us know about your circumstances when you apply, and we’ll take it from there.\nWe’re closing the gender gap – whether that’s through action on equal pay or by enabling more women to reach senior roles in engineering and technology.\nWe’re striving to be a pioneer of an inclusive and diverse workplace, promoting equality for employees regardless of sexual orientation or gender identity.\nWe consider ourselves a flexible employer and want to support you finding the right balance. We encourage you to discuss this with us in your application.\nA rewarding place to work\nCombine our creative, collaborative environment and global operations with an impressive range of benefits and joining Shell becomes an inspired career choice.\nWe’re huge advocates for career development. We’ll encourage you to try new roles and experience new settings. By pushing people to reach their potential, we frequently help them find skills they never knew they had, or make career moves they never thought possible."
    },
    {
        "job title": "Software Engineer (Front-end)",
        "company_name": "Helium Health",
        "company_location": "Lagos",
        "job type": " ",
        "job content": "Helium Health is a full-service Healthtech company that provides a suite of solutions for healthcare providers, payers, and patients in emerging markets — at the core of which is our SaaS based electronic medical records/hospital management information system (EMR/HMIS).\n\nWe are looking to hire a Mid level Frontend Engineer who will be responsible for all aspects of the development and delivery of applications.\nResponsibilities\nCollaborate with product managers, designers and developers to conceptualize and build new products, features and changes that’ll radically improve user experience.\nWrite well-documented code for features, tests and other front-end web and mobile application components.\nEnsure the front-end web and mobile applications work well across all target platforms.\nWork closely with back-end developers to continuously improve our ability to deliver awesome front-end web and mobile experiences.\nWork with internal and external stakeholders; motivating, persuading, and negotiating towards a positive outcome.\n\nRequirements\nBachelor’s degree in computer science or a related discipline with 3 - 5 years of professional experience as a software engineer.\nGood knowledge of any modern framework like React, Vue, Angular or Ember.\nGood knowledge of HTML5 and CSS3 APIs.\nExperience in styling with solutions like Styled Components/CSS Modules/PostCSS/Sass/Less.\nExperience with modern front-end workflows: git flow, project management tools, unit and E2E testing, build tools, REST APIs, CLIs, CI/CD.\nManaging complex application state with Redux/Vue.\n\nWorking Environment:\nNigeria region, with opportunity for remote work\n\nRemuneration:\nCompetitive based on experience.\n\nBenefits:\nHealth cover, Opportunity to choose from a range of home service options; Paid time off (20 days Annual Leave, 60 days paid Maternity Leave and 20 days paid Paternity Leave, Adoption Leave, paid Sick Leave, 7 days Volunteer Leave); Pension Scheme; Life Insurance; and other company benefits and perks.\nRobust Learning and Development Opportunities; Team-building activities and social events; Remote first orientation; Amazing team culture!\n\nEqual Opportunity Employer\n“Helium Health is an equal opportunity employer, thus it is not biased in its employment to any race, colour, creed, religion, sex or physical disability.”"
    },
    {
        "job title": "PHP Software Engineer - Jumia (Full Time)",
        "company_name": "Jumia",
        "company_location": "Nigeria",
        "job type": " ",
        "job content": "About Jumia:\nJumia is the leading pan-Africa e-commerce platform. Founded in 2012, Jumia’s mission is to improve the quality of everyday life in Africa by leveraging technology to deliver innovative, convenient and affordable online services to consumers, while helping businesses grow as they use our platform to reach and serve consumers.\nOur platforms among others, comprises of:\nMarketplace, where we integrate with our sellers and manage products;\nMall, which is our core e-com platform that enables customers to buy products;\nLogistics service, which enables the shipment and delivery of packages from sellers to consumers, and our external clients;\nPayment service, which facilitates transactions among participants active on our platform in our markets.\nThrough our online platforms, consumers can access a wide range of physical and digital goods and services, fashion, electronics, beauty products and also hotel and flight bookings or restaurant delivery.\nWith over 5,000 employees in more than 10 countries in Africa, Jumia is led by top talented leaders offering a great mix of local and international talents and is backed by very high-profile shareholders. Jumia is committed to creating a sustainable impact for Africa. Jumia offers unique opportunities in a vibrant and booming environment, creating new jobs and skills, and empowering a new generation.\nTech at Jumia:\nWe are a Tech Driven company with an Innovative spirit. At Jumia Tech, you will work under the most updated technologies and work methodologies, collaborating between multiple teams across disciplines - Business, Product and Engineering. We are great fans of Agile philosophy and we aim to keep things simple but smart and fast. Also, for Jumia, technology relates with improvement for our world. We see technology as something we need to put purpose into. Our mission is to leverage technology to improve everyday life in Africa and we do it by delivering convenient and affordable online services to consumers, helping them fulfill basic everyday needs. And while we’re present in Africa, we get to take African economy online, helping small and large businesses grow and reach new consumers. This is what drives our day to day decisions.\nWe are looking for great people to join our amazing teams and celebrate our achievements. At Jumia we work hard, but we do Tech With Purpose!\nWhat you will be doing:\n\nAs a Senior PHP Developer, you will be part of an agile Software Development Team and will be responsible for the full lifecycle of an application.\nYou will be working with a team of talented Engineers and entrusted in defining the solution, leading the design, architecture and development of web applications using PHP and related technologies;\nYou will collaborate with the product team and stakeholders to translate product feature requirements into sechnical specifications, and will identify the best approach for large pieces of work that span multiple components and teams;\nYou will perform code reviews, provide feedback and guidance to your team, and ensure the overall quality and maintainability;\nYou will be instrumental in optimizing performance of the application by implementing caching mechanisms, database optimizations and applicable code refactoring;\nYou will troubleshoot and resolve complex technical issues in highly distributed systems;\nYou will also be mentoring your junior colleagues, and helping elevate the skills and developing the team, ensuring the team stays up to date and applies the new trends in the industry;\nAs an expert in the area, you will be the go-to person for big ideas and problem-solving;\nWith your large expertise, we know that you'll add a lot of value to the team - be it by suggesting alternative methodologies that may be more efficient, actively improving the tooling to improve use cases, or even designing and developing a technical solution or new processes to create robust, reliable and scalable systems;\nYou can expect to use cutting-edge technologies to deliver amazing value and the best product to our customers while scaling our platform to meet the demands of worldwide markets;\nYou will be required to program well-designed, testable, efficient code to solve business needs, as well as test and document the implemented solutions.\nWhat we are looking for:\nTechnical Skills:\n8+ Years of Experience in web application development in PHP, with a strong understanding of PHP language and frameworks (e.g. Zend Expressive, Laravel, Symfony)\nAcquainted with building testable code, unit tests and/or integration tests\nKnowledgeable of software design and architecture patterns\nStrong knowledge of relational databases (especially MySQL) and SQL, performance tuning and optimizations\nExperience in working with high concurrency, highly transactable, high available platforms\nExperience in migration of legacy systems\nExperience in API integrations, web services and third party libraries\nExperience with code versioning tools\nDevSecOps mindset\nAware of fault-tolerance and secure programming concepts\nExperienced in some of the following concepts: message queuing, caching, NoSQL, SOA, CI/CD, application and system monitoring\nExperienced working with Scrum processes\nExperience of working with Gearman would be a plus\nProficiency in other front end technologies like html, css, js is a plus\nSoft Skills:\nFluent in English, strong communication and collaboration abilities\nAbility to drive consensus in a multi disciplinary environment\nCritical thinking and Problem solving capabilities\nAnalytical and troubleshooting skills\nOpenness to handling both legacy systems and greenfield projects\nBeing resilient and Challenging the status quo\nExtreme accountability and drive for results\nWe Offer:\nA unique experience in an entrepreneurial, yet structured environment\nA unique opportunity of having strong impact in building the African e-commerce sector\nThe opportunity to become part of a highly professional and dynamic team\nAn unparalleled personal and professional growth as our longer term objective is to train the next generation of leaders"
    },
    {
        "job title": "Software Engineer (Python/Django)",
        "company_name": "Ayulla Inc.",
        "company_location": "Nigeria",
        "job type": " ",
        "job content": "Software Engineer (Python/Django)\nAyulla Inc.\nSoftware & Data\nRemote (Work From Home) Full Time\nIT & Telecoms NGN 250,000 - 400,000\nNew Featured\n6 days ago\nJob Summary\nWe are looking for a talented Python/Django backend engineer to join our growing engineering team who is responsible for developing and maintaining various software products in our portfolio. As a backend software engineer at Ayulla, you will be responsible for writing, testing, and debugging new and existing codes.\nMinimum Qualification: Degree\nExperience Level: Mid level\nExperience Length: 2 years\nJob Description/Requirements\nAyulla is a tech startup driven by the unending effort to design and deploy massive software that we believe will be a major landmark in its class\n\nResponsibilities:\n\nDevelop well-designed, scalable, and robust software to a high-quality standard\nDevelop flowcharts, layouts, and documentation to identify requirements and solutions\nIntegrate software components into a fully functional software system\nDocument and maintain software functionality\nTroubleshoot, debug, and upgrade existing systems\nStay up-to-date with the latest and emerging technologies\n\nRequirements:\nBachelor's degree or higher in Computer Science, Software Engineering, or any related field, or equivalent field experience\nAt least 1 year of experience working in Python, Django, and Django REST Framework\nAt least 1 year of hands-on experience in developing web applications\n2 years of working experience\nStrong computer science fundamentals and problem-solving\nGood communication and collaboration skills\n\nNote: A Bachelor's degree or higher in Computer Science, Software Engineering, or any related field could be an advantage in this role, it is not a requirement. A significant field experience developing and deploying software solutions is highly valued and in most cases considered superior to a Bachelor's degree in any field of computing."
    },
    {
        "job title": "Mechanical Technician",
        "company_name": "JNC",
        "company_location": "Port Harcourt",
        "job type": " ",
        "job content": "JOB TITLE: Mechanical Technician\nLOCATION: Port Harcourt\nJOB SUMMARY:\nMechanical technicians are highly skilled workers who install, repair and maintain a wide range of mechanical systems. Mechanical technicians optimize the performance of mechanical products, machinery, and equipment. They design mechanical products, analyze performance results, and maintain mechanical equipment and machinery.\nJOB DESCRIPTION:\nAssisting the mechanical engineer with mechanical design and maintenance tasks.\nInstalling and performing diagnostic tests on mechanical systems.\nDeveloping and implementing mechanical maintenance plans to prevent costly equipment breakdowns.\nTroubleshooting mechanical malfunctions and breakdowns, as well as performing repairs.\nDocumenting processes and maintaining mechanical service records.\nMonitoring the availability of parts and replenishing supplies.\nOptimizing mechanical efficiency by adjusting machinery and equipment settings.\nTraining co-workers on the safe and efficient use of mechanical machinery and equipment.\nMaintaining a tidy work environment and adhering to industry regulations\nJOB REQUIREMENTS:\nGraduate in Mechanical Engineering\n5-6 years’ experience in similar fields\nExperience in Maintenance of Process and Packaging\nExtensive knowledge of mechanical engineering designs, installations, maintenance, and repairs.\nProficiency in mechanical design and diagnostic testing software.\nExceptional analytical, critical thinking skills\nExcellent problem-solving abilities.\nExcellent communication and collaboration skills.\nGreat organizational and time management abilities.\nWillingness to perform mechanical maintenance and repairs outside of business hours\nJob Type: Full-time\nPay: ₦150,000.00 - ₦250,000.00 per month\nAbility to commute/relocate:\nPort Harcourt: Reliably commute or planning to relocate before starting work (Preferred)\nApplication Question(s):\nWhat is your gender?\nHow much do you currently earn?\nHow soon are you able to resume?\nWhere do you stay?"
    },
    {
        "job title": "Software Engineer",
        "company_name": "Ayulla Inc.",
        "company_location": "Nigeria",
        "job type": " ",
        "job content": "Software Engineer\nAyulla Inc.\nSoftware & Data\nRemote (Work From Home) Full Time\nIT & Telecoms NGN 250,000 - 400,000 Negotiable\nNew\n1 week ago\nJob Summary\nWe are looking for talented Python/Django backend engineers to join our growing engineering team who are responsible for developing and maintaining various software products in our portfolio.\nMinimum Qualification: Degree\nExperience Level: Mid level\nExperience Length: 2 years\nJob Description/Requirements\nResponsibilities:\nDevelop well-designed, scalable, and robust software to a high-quality standard\nDevelop flowcharts, layouts, and documentation to identify requirements and solutions\nIntegrate software components into a fully functional software system\nDocument and maintain software functionality\nTroubleshoot, debug, and upgrade existing systems\nStay up-to-date with the latest and emerging technologies\n\nRequirements:\nProven work experience as a Software Engineer or Software Developer\nExperience designing interactive applications\nAbility to develop software in Java, Ruby on Rails, C++ or other programming languages\nExcellent knowledge of relational databases, SQL, and ORM technologies\nExperience developing web applications using at least one popular web framework\nExperience with test-driven development\nProficiency in software engineering tools\nAbility to document requirements and specifications"
    },
    {
        "job title": "Senior DevOps Engineer",
        "company_name": "Confidential Crypto Company",
        "company_location": "Lagos",
        "job type": " ",
        "job content": "We are looking for a Senior DevOps engineer heavily knowledgeable in either Kubernetes, AWS infrastructure to help our platform and SaaS product teams deploy, manage and maintain multiple software products\nProficient in developing Infrastructure-as-Code (e.g.: Terraform / AWS CloudFormation)\nProficient in coding configuration management tooling (e.g.: Ansible, Chef, Puppet, etc.)\nProficient in at least one or more programming / scripting languages (e.g.: Python, Ruby, Go, Swift, Java, .Net, C++)\nDemonstrable knowledge of Agile methodologies\nAttention to detail\nCertifications (e.g.: Certified Kubernetes Administrator (strongly preferred), AWS Solution Architect - Professional, AWS DevOps Engineer - Professional, AWS Data Analytics - Specialty, etc.)\nImplementing static and dynamic code analysis tools and testing tools within CI/CD pipelines\nExperience with Kubernetes service mesh architectures such as ISTIO\nAdvanced-level knowledge in networking and routing within AWS\nSupporting developers in efficiently working within AWS through:\nArchitecting, coding, deploying, and troubleshooting Continuous Integration / Continuous Deployment (CI/CD) pipelines\nUsing Helm Charts, Custom Resource Definitions\nCreating cloud-native CI/CD workflows for containers with tools such as Jenkins, CodeDeploy, CodePipeline, Gitlab, etc.\nHands-on experience with microservices and distributed application architecture in a multi-tier environment (Dev, Test, Prod, etc.)\nThis is a Full-Time remote role. Crypto as a payment option is possible.\nJob Type: Full-time\nPay: ₦800,000.00 - ₦1,500,000.00 per month\nApplication Question(s):\nAre you currently employed?\nWhich cloud provider are you most familiar with?\nWhat is Terraform?\nWhat is your salary range?\nWhich certifications do you have?\nHow soon can you start?\nExperience:\nTerraform: 2 years (Preferred)\nKubernetes: 2 years (Preferred)\nAWS: 2 years (Preferred)\nAnsible: 2 years (Preferred)\nJenkins: 2 years (Preferred)\nApplication Deadline: 30/11/2023\nExpected Start Date: 13/11/2023"
    },
    {
        "job title": "Project Engineer II",
        "company_name": "Habrams Energy Services",
        "company_location": "Uyo",
        "job type": " ",
        "job content": "MAIN FUNCTIONS\nEvaluate and comment on discipline engineering work performed both internally and by Contractors and sub-contractors to ensure that work is being executed in accordance with Company specifications, company standards, and regulatory requirements. Facilitates effective execution of discipline engineering and design routines that align with the team's goals, objectives, and procedures. Assures accurate and timely communication among the team and other company Functions on discipline engineering activities, progress, and issues. In addition to technical ability, they should demonstrate sound communication, facilitation, and interpersonal skills.\nTASKS AND RESPONSIBILITIES\nPlan and manage the pipeline and subsea activities in early part of the project phases.\nProvide pipeline engineering inputs.\nProvide technical authority assurance role.\nDefine fit for purpose pipeline solutions.\nLead pipeline feasibility and concept select studies, performing pipeline routing studies, execute hydraulic analyses, perform onshore/offshore pipeline mechanical design including support for material selection, cost estimating and constructability reviews.\nProject Management and supervision of 3rd Party Contractor activities, review, improve and approve Front End Engineering and Design, and Detailed Design documents.\nAssess development risks, including HS&E assessment, and propose mitigation plan.\nPlan and implement assurance process at key stages of the development.\nSupport the Business Planning and Work Program and Budget exercise.\nFocus on Standard Solution & New Business Development opportunities from identify stage to Basis for Design.\nEnsure deployment of new technology and drive applications gaining acceptance with the projects/assets leaders.\nSKILLS AND QUALIFICATIONS\nBachelor’s degree in Civil or Mechanical Engineering or related engineering specialty or equivalent professional experience\nOil and gas experience preferred\nExperience in dealing with front end project delivery\nRobust experience in business and project planning.\nStrong experience of working with sub-surface disciplines.\nRequires strong knowledge of offshore facilities, and offshore facilities project delivery and awareness of worldwide practices, successes, failures and technical benchmarks.\nStrong knowledge of discipline design standards, specifications, codes, and appropriate safety criteria\nAbility to adapt to tight deadlines, heavy workloads, and frequent changes in priorities\nProficient in Microsoft Office suite of software programs\nRead, write, and speak fluent English, especially as it applies to technical and business communications\nJob Type: Full-time\nSalary: ₦400,000.00 - ₦700,000.00 per month\nAbility to commute/relocate:\nUyo: Reliably commute or planning to relocate before starting work (Required)\nEducation:\nUndergraduate (Required)\nExperience:\nProject management and control activities: 10 years (Required)\ndesign standards, specifications & work processes: 5 years (Preferred)\nengineering: 10 years (Required)\nConstruction: 10 years (Required)"
    },
    {
        "job title": "Backend Engineer",
        "company_name": "Duplo",
        "company_location": "Nigeria",
        "job type": " ",
        "job content": "Duplo is a Lagos-based fintech startup that enables businesses in Africa to digitize their receivables and payables, reduce time-to-cash, lower transaction costs, and generate more revenue from their business customers.\n\nWe want to make B2B payments as simple as P2P payment apps. Most business payments in Africa are made offline….yikes. We are on a mission to transform this.\nWe are backed by top investors including Tribe Capital, Commerce Ventures, Liquid2 Ventures, My Asia VC, Soma Capital, YCombintaor, Oui Capital, and others.\n\nThis is a unique opportunity. You'll have the responsibility and resources to take a significant part in the creation of a paradigm-changing product that will impact millions.\n\nResponsibilities:\n\nWork closely with engineering leads to aiding with architecture decisions for the application and supporting infrastructure.\nHelp develop and own release versioning control and related documentation\nDesign and implement testing and quality validation strategies.\nBuilding Restful APIs, SDKs, backend features, micro-services and infrastructure.\n\nTechnical & Professional Requirements:\n\nStrong knowledge of NodeJS and relevant frameworks\nSolid understanding of HTTP protocol and how server-side code is processed on the client\nExperience with typescript\nStrong working knowledge of Relational databases and NoSQL DB (Mongo DB)\nSQL / Database Queries\nStrong understanding of software development and design patterns\nGood working knowledge of ORMs\nHave a reasonable understanding of containerization (Docker, Kubernetes)\nHave strong experience creating and automating E2E tests.\nAn eye for detail is crucial\nAble to handle multiple projects and competing deadlines\nExperience with deploying code multiple times a day\nExperience with Scrum/Agile methodologies (Jira)\n\nRelevant Experience:\n\n3 -5 years experience as a Backend Engineer\nAn execution mindset, good analytic skills and a team-play attitude.\nExcellent communication and organizational skills\nPrior experience working in fintech is an advantage."
    },
    {
        "job title": "Backend Software Engineer, Nigeria - Remote",
        "company_name": "Branch International",
        "company_location": "Nigeria",
        "job type": " ",
        "job content": "Branch Overview\nImagine a world where every person has improved access to financial services. People could start new businesses, pay for their children’s education, cover their emergency medical bills – the possibilities to improve life are endless.\nBranch is a global technology company revolutionizing financial access for millions of underserved banking customers today across Africa and India. By leveraging the rapid adoption of smartphones, machine learning and other technology, Branch is pioneering new ways to improve access and value for those overlooked by banks. From instant loans to market-leading investment yields, Branch offers a variety of products that help our customers be financially empowered.\nBranch’s mission-driven team is led by the co-founders of Kiva.org and one of the earliest product leaders of PayPal. Branch has raised over $100 million from leading Silicon Valley investors, including Andreessen Horowitz (a16z) and Visa.\nWith over 32 million downloads, Branch is one of the most popular finance apps in the world.\n\nAbout the role\nBranch launched in Nigeria in 2017 and has seen rapid adoption and growth. In 2021, we plan to grow our engineering team in Nigeria significantly. As part of this team, you will work closely with our global engineering team (distributed across three continents) to strengthen the capabilities of our existing product and build out new products for Branch. Example projects include: Building new functionality for our Credit and Wallet products; helping improve the reliability of our core payments and banking systems; architecting data pipelines and machine learning models for credit underwriting; and more.\nAs a company, we are passionate about our customers, fearless in the face of barriers, and driven by data. As an engineering team, we value bottom-up innovation and decentralized decision-making. We believe the best ideas can come from anyone in the company, and we are working hard to create an environment where everyone feels empowered to propose solutions to the challenges we face. We are looking for individuals who thrive in a fast-moving, innovative, and customer-focused setting.\nHere are some things you'll do\nBuild out backend functionality for existing and new product lines such as Credit, Wallet, Bill Pay, and others.\nIntegrate with various third-party systems, including payment systems, identity providers, and messaging platforms.\nScale our backend services and pipelines to ever-growing levels of traffic and complexity.\nHelp build flexible and easy-to-use tools used by our operations teams to handle customer inquiries and other business processes.\nMinimum Requirements\nYou have strong experience (2+ years) of building backend software for web-based or mobile products.\nYou are an excellent collaborator and communicator. You listen to others and seek to understand, but aren’t afraid to speak your mind and debate in a respectful manner when you disagree.\nYou are excited by the prospect of working in a distributed team and company, working with teammates from all over the world.\nPreferred Requirements\nYou have a solid foundation in computer science fundamentals, distributed systems, data storage, and agile development methodologies.\nYou are pragmatic and combine a strong understanding of technology and product needs to arrive at the best solution for a given problem.\nYou are highly entrepreneurial and thrive in taking ownership of your own impact. You proactively identify problems and propose solutions.\n\nBenefits of Joining\nWork in a mission-driven, global, fast-paced and entrepreneurial environment\nCompetitive salary and equity package\nA collaborative and flat company culture\nRemote first, with the option to work in-person occasionally\nFully paid life and health insurance benefit with Axa Mansard (Platinum plan)\nWork-life balance is not a myth, we offer a generous paid leave policy comprising; 28 days annual leave, 30 days sick leave, bereavement leave\nFully paid parental leave - 6 months maternity and 3 months paternity leave\nPension Benefit\nMonthly WFH stipend alongside a one time home office set-up budget\nWe believe learning should never stop and so we provide a $500 stipend annually towards learning and development irrespective of role, title or tenure\nDiscretionary trips to our offices across the globe, with global travel medical insurance\nTeam meals and social events (Hybrid for now)\nFlexible working hours\nOpportunity to work and interact with a global team\n\nWe’re looking for more than just qualifications - so if you’re unsure that you meet the criteria, please do not hesitate to apply!\nBranch International is an Equal Opportunity Employer. The company does not and will not discriminate in employment on any basis prohibited by applicable law.\n\nLocation\nThis is a remote role. We are open to working with you provided you are able to work within the West African Time (WAT) zone.\n\nsATwex1bv6"
    },
    {
        "job title": "Software Support Engineer (Kenya/Nigeria)",
        "company_name": "Seeq Corporation",
        "company_location": "Nigeria",
        "job type": " ",
        "job content": "Seeq makes data analytics software for a big market that’s often overlooked by tech companies: industrial process data. Think pharmaceutical manufacturers, wind farms, and energy companies with tons of equipment and sensors.\nOur company is 100% remote and proud of it. We use a variety of collaboration tools, like Zoom, Slack, and our homegrown Qube Virtual Office, which makes us feel like we’re in the same building together. We have a wonderful team of kind-hearted, talented engineers that love to collaborate, teach each other new tricks, and build products that exceed our customers’ expectations.\nThe core of our product is a full-featured calculation engine that can perform complex math and execute machine learning algorithms on streaming time-series data.\nKey Responsibilities\nAs a Software Support Engineer (SSE) working from either Kenya or Nigeria, you’ll join our growing team to help our customers install our software (or, in the case of our cloud offering, deploy to one of our cloud-hosted environments), connect to their data sources, integrate their identity/authentication infrastructure, and upgrade to new versions. You will interact with customers directly (usually over Zoom web conferencing) to troubleshoot technical issues with our software and issues in the customers' environment (firewalls, third-party authentication, and general IT issues affecting our software deployment). You will be a member of the product development team and will have a strong voice in shaping development efforts to improve customer satisfaction and mitigate common pain points.\nQualifications\nSeeq prefers to emphasize talent, capacity to contribute, and passion, but the ideal candidate is likely to have many of the following characteristics:\nCandidate is motivated by solving customer problems with a knack for tenaciously digging in to find the real root cause.\nResponsive and communicative with an enthusiastic drive to help customers even during off-hours.\nFamiliarity with Linux and Windows\n- we deploy on both platforms. You are familiar with either AWS or Azure cloud environments.\nCandidate is disciplined with high attention to detail and enjoys sleuthing through multiple logs to tie together theories.\nQuick learner known for suggesting new ideas and raising the bar for the whole team.\nCapable of deep investigation of issues using standard system tools like Task Manger, Process Explorer and even Wireshark or other Windows Sysinternal power tools. Experience troubleshooting networking technologies such as TCP/IP, HTTP(S), and Ethernet.\nBachelor's or Associate Degree in Computer Science, Information Technology / Information Systems or related field.\nPrevious startup experience is a plus.\n\n\nWe are organized as a virtual company with a headquarters in Seattle, WA. We use state-of-the-art online collaboration tools for development and corporate functions. Employees can be based virtually anywhere as long as they have access to a good office environment, high-bandwidth connectivity (at least 3 Mbit uplink and 30 Mbit downlink).\nThe best applicants are ones who include cover letters explaining how their backgrounds, experiences, and interests match Seeq's position description. Please let us know how you will contribute to our mission and our future success.\nAbout Seeq\nSeeq is a remote-first (only) company founded by serial entrepreneurs. Our executive team and board of directors have extensive experience with successful startup ventures in high-growth environments.\nWe are founded on the idea that companies need better solutions for quickly and easily getting business insight from their industrial process data. Our mission is to provide software and services that convert that data into meaningful information that the business can use to improve profitability.\nWe use the best modern big data technologies to bring industrial process data into the business decision process.\nOur company is virtual, meaning that everyone works from a location of their choosing. There’s no commute and no cubicle! We are serious about recruiting and retaining the best teammates. We think there are tons of benefits to working on exciting technology with a cohesive team and the flexibility to work from anywhere.\nWe have a wonderful, kind-hearted, talented team that loves to collaborate, lead by example, and love to exceed our customers’ expectations. We are certified as a Great Place to Work, Emerging Startup, Technology Fast 500, and Inc. Magazine's Best Places to Work.\nThe Perks of Working at Seeq\nCompetitive salary plus equity incentives\nImportant benefits like this (because we want you to be happy):\nFreedom PTO\n5-weeks paid Seeq family leave\nInternet and mobile phone reimbursement\nVacation bonus program\nFringe Benefits\nGenerous home office allowance\nThe best co-workers (we've analyzed the data, so we know it's true)\nPet-friendly workspace (your dog will be so happy to have you home)\nLoving your job!\nSeeq provides equal employment opportunities (EEO) to all employees and applicants for employment without regard to race, color, religion, sex, national origin, age, disability or genetics."
    },
    {
        "job title": "Java Software Engineer",
        "company_name": "Interswitch",
        "company_location": "Lagos",
        "job type": " ",
        "job content": "Interswitch Group is an Africa-focused integrated digital payments and commerce company that facilitates the electronic circulation of money as well as the exchange of value between individuals and organizations on a timely and consistent basis. The company started its operations in 2002 as a transaction switching and electronic payments processing company. It has progressively evolved into an integrated payment services company and delivers innovative payment products and transactional services throughout the African continent. Interswitch offers unique career opportunities for individuals capable of playing key roles and adding value in an innovative and fun environment.\nWe are recruiting to fill the position below:\nJob Position: Java Software Engineer\nJob Location: Lagos (Hybrid)\nTime Type: Full time\nRole Description\nThe Java Software Engineer will be responsible for designing, developing, and maintaining Java-based software applications.\nThe role involves developing high-quality, reliable, and scalable software and collaborating with cross-functional teams to identify, troubleshoot, and fix software issues.\nThis is a full-time hybrid role located in Lagos, with flexibility for some remote work.\nQualifications\nBachelor's Degree in Computer Science or a related field\nExperience in the fintech industry is a plus\nStrong skills in Software Development, Microservices, and Programming\nExperience in designing and implementing scalable software architecture\nKnowledge of Agile and Scrum methodologies\nProficiency in Spring Framework and Java programming language\nExperience in developing web services and RESTful APIs\nExcellent problem-solving and analytical skills\nStrong communication and interpersonal skills."
    },
    {
        "job title": "Engineer, Software",
        "company_name": "Standard Bank",
        "company_location": "Zamfara",
        "job type": " ",
        "job content": "Job Overview\nBusiness Segment: Group Functions\nLocation: ZA, undefined, All major cities, Head Office sites\nJob Type: Full-time\nJob ID: 80414850\nDate Posted: 11/8/2023\n\nJob Description\n\nTo apply computer science theories, principals to create, refactor moderate to complex programs/scripts, integration software services. To design complex specifications, code, test, debug, enhance programs within the Continuous delivery pipelines and provide support, maintenance of systems, programmes. To execute software developer responsibilities according to Engineer practice, standards, frameworks, roadmaps and the architects application standards. Participate in reviews of colleagues' work.\n\nQualifications\nFirst Degree in Information Technology\n5-7 years broad experience in translating business and functional requirements into technical specifications and developing the programming code to create the solutions\nPractical experience with Java, REST API and Spring Boot\n8-10 years proven experience in modern engineering practices such as DevOps and Agile\nProven experience across multiple, broad IT Engineering disciplines, with demonstrated specialisation in at least one\nAdditional Information\n\nBehavioral Competencies:\nAdopting Practical Approaches\nChecking Details\nDeveloping Expertise\nExamining Information\nTeam Working\n\nTechnical Competencies:\nAgile Development\nApplication Support\nDesign Patterns\nDEVOPS\nWrite Code\n\nPlease note: All our recruitment processes comply with the applicable local laws and regulations. We will never ask for money or any from of payment as part of our recruitment process. If you experience this, please contact our Fraud line on +27 800222050 or TransactionFraudOpsSA@standardbank.co.za"
    },
    {
        "job title": "Mechanical Technician (Ikorodu)",
        "company_name": "Ascentech Services Ltd",
        "company_location": "Lagos",
        "job type": " ",
        "job content": "Mechanical Technician Responsibilities:\nAssisting the mechanical engineer with mechanical design and maintenance tasks.\nInstalling and performing diagnostic tests on mechanical systems such as CNG Compessor, Air Coolers, Gas Generators as well as V-belt Pully System.\nDeveloping and implementing mechanical maintenance plans to prevent costly equipment breakdowns.\nTroubleshooting mechanical malfunctions and breakdowns, as well as performing repairs.\nDocumenting processes and maintaining mechanical service records.\nMonitoring the availability of parts and replenishing supplies.\nOptimizing mechanical efficiency by adjusting machinery and equipment settings.\nTraining co-workers on the safe and efficient use of mechanical machinery and equipment.\nMaintaining a tidy work environment and adhering to industry regulations.\nMechanical Technician Requirements:\nA Bachelor's or Diploma in Mechanical Engineering\nKnowledge of the CNG compressor, air cooler, Gas generator, v-belt pully system\nA minimum of five years' experience as a mechanical technician in a related industry.\nExtensive knowledge of mechanical engineering designs, installations, maintenance, and repairs.\nProficiency in mechanical design and diagnostic testing software.\nExceptional analytical, critical thinking, and problem-solving abilities.\nExcellent communication and collaboration skills.\nGreat organizational and time management abilities.\nJob Type: Full-time\nPay: ₦100,000.00 - ₦120,000.00 per month\nAbility to commute/relocate:\nLagos: Reliably commute or planning to relocate before starting work (Required)\nExperience:\nMechanical Technician: 3 years (Required)"
    }
]