[
    {
        "job_title": "Software Quality Assurance (QA) Engineer",
        "company_name": "Tekrecruiters",
        "company_location": "Lagos",
        "job_content": "Quality Assurance (QA) Engineer\nWe are Zone Network Payment Limited based in Lagos, Nigeria.\nZone is a regulated blockchain network that enables payments and acceptance of digital currencies. Our Layer-1 Blockchain network digitizes Fiat payments and enables the transition to digital currencies while connecting previously excluded financial institutions into an all-inclusive payment ecosystem.\nWe recognize that our super-talented and highly motivated people are at the core of our unprecedented success so far. As such, we hire people with exceptional talents and abilities into an enabling environment where you can become a better version of yourself and thrive both professionally and personally while delivering impact and having fun!\nYour contributions have the potential to impact millions of people across Africa as we work together to connect to the future.\nJob Profile:\nWe seek an innovative, self-driven and ambitious software automation tester to join our Software testing team! As a software automation tester, you will be responsible for test planning, test script, test scenarios, test data etc..\nAs a Software Quality Assurance Engineer, your job responsibilities include the following:\nAnalysis of software’s functional and technical requirements as well as design peculiarities and architecture to identify relevant testing considerations.\nCreation of test plans that contain expected timelines for completion and address all considerations raised during the analysis phase.\nArticulation and documentation of test information including test planning, test scripts, test scenarios, test data, pre-conditions, and test outcomes.\nManual and automated Regression test.\nConduct functional and non-functional testing of applications.\nWork with the QA team and Manager.\nWe would love to meet you if:\nYou want to build something that endures. The legacy of the work you do matters to you.\nYou have strong capabilities in source code management, software development life cycle (SDLC), Test planning, Test management, test Execution, test management, Test automation, Load Testing and Security Testing.\nYou have a good knowledge of software, Payment, and banking.\nYou are highly proficient in problem solving, time management, analytical thinking, ambitious and have a great drive to succeed.\nYou have a strong attention to detail, great communication skills, work well in a team and with cross-functional teams.\nExcellent problem-solving skills and the ability to work effectively under pressure.\nHands-on experience in working with production environments with zero tolerance for any errors.\nStrong communication skills and the ability to collaborate with cross-functional teams.\nA continuous improvement mindset, staying up to date with the latest industry trends and technologies.\nThese are some of the nitty-gritty things you may have listed on your CV/LinkedIn profile but certainly do not define who you are:\nB.Sc. in Computer Science, Information Technology, Engineering, or closely related field.\n> 4 years Quality assurance (manual and automation) testing work experience in a Fintech company, E-Commence Company, Software testing Company, software company, Banking Industry etc.\nPhysical Requirements:\nWe currently run a flexible work structure; some days are remote while others require you to collaborate with colleagues at the office location.\nFor each situation, you may have:\n● Prolonged periods sitting at a desk and working on a computer.\nThis role reports to the QA Manager.\nLocation: Lagos, Nigeria\nJob Type: Full-time\nSalary: ₦500,000.00 - ₦800,000.00 per month\nAbility to commute/relocate:\nLagos: Reliably commute or planning to relocate before starting work (Required)\nApplication Question(s):\nWhat is your Current Salary?\nWhat is your Expected Salary?\nWhat is your Notice Period?\nEducation:\nUndergraduate (Preferred)\nExperience:\nQuality Assurance: 4 years (Required)",
        "job_url": "https://ng.indeed.com/company/Tekrecruiters/jobs/Quality-Assurance-Engineer-69bafa0a568c50e4?fccid=67fbaef8f2039b04&vjs=3"
    },
    {
        "job_title": "Software Engineer (Front-end)",
        "company_name": "Helium Health",
        "company_location": "Lagos",
        "job_content": "Helium Health is a full-service Healthtech company that provides a suite of solutions for healthcare providers, payers, and patients in emerging markets — at the core of which is our SaaS based electronic medical records/hospital management information system (EMR/HMIS).\n\nWe are looking to hire a Mid level Frontend Engineer who will be responsible for all aspects of the development and delivery of applications.\nResponsibilities\nCollaborate with product managers, designers and developers to conceptualize and build new products, features and changes that’ll radically improve user experience.\nWrite well-documented code for features, tests and other front-end web and mobile application components.\nEnsure the front-end web and mobile applications work well across all target platforms.\nWork closely with back-end developers to continuously improve our ability to deliver awesome front-end web and mobile experiences.\nWork with internal and external stakeholders; motivating, persuading, and negotiating towards a positive outcome.\n\nRequirements\nBachelor’s degree in computer science or a related discipline with 3 - 5 years of professional experience as a software engineer.\nGood knowledge of any modern framework like React, Vue, Angular or Ember.\nGood knowledge of HTML5 and CSS3 APIs.\nExperience in styling with solutions like Styled Components/CSS Modules/PostCSS/Sass/Less.\nExperience with modern front-end workflows: git flow, project management tools, unit and E2E testing, build tools, REST APIs, CLIs, CI/CD.\nManaging complex application state with Redux/Vue.\n\nWorking Environment:\nNigeria region, with opportunity for remote work\n\nRemuneration:\nCompetitive based on experience.\n\nBenefits:\nHealth cover, Opportunity to choose from a range of home service options; Paid time off (20 days Annual Leave, 60 days paid Maternity Leave and 20 days paid Paternity Leave, Adoption Leave, paid Sick Leave, 7 days Volunteer Leave); Pension Scheme; Life Insurance; and other company benefits and perks.\nRobust Learning and Development Opportunities; Team-building activities and social events; Remote first orientation; Amazing team culture!\n\nEqual Opportunity Employer\n“Helium Health is an equal opportunity employer, thus it is not biased in its employment to any race, colour, creed, religion, sex or physical disability.”",
        "job_url": "https://ng.indeed.com/rc/clk?jk=75db9ccb9d3093b6&fccid=4e160f66949b9bac&vjs=3"
    },
    {
        "job_title": "Senior Java Software Engineer - Jumia (Full Time)",
        "company_name": "Jumia",
        "company_location": "Nigeria",
        "job_content": "About Jumia:\nJumia is the leading pan-Africa e-commerce platform. Founded in 2012, Jumia’s mission is to improve the quality of everyday life in Africa by leveraging technology to deliver innovative, convenient and affordable online services to consumers, while helping businesses grow as they use our platform to reach and serve consumers.\nOur platforms among others, comprises of:\nMarketplace, where we integrate with our sellers and manage products;\nMall, which is our core e-com platform that enables customers to buy products;\nLogistics service, which enables the shipment and delivery of packages from sellers to consumers, and our external clients;\nPayment service, which facilitates transactions among participants active on our platform in our markets.\nThrough our online platforms, consumers can access a wide range of physical and digital goods and services, fashion, electronics, beauty products and also hotel and flight bookings or restaurant delivery.\nWith over 5,000 employees in more than 10 countries in Africa, Jumia is led by top talented leaders offering a great mix of local and international talents and is backed by very high-profile shareholders. Jumia is committed to creating a sustainable impact for Africa. Jumia offers unique opportunities in a vibrant and booming environment, creating new jobs and skills, and empowering a new generation.\nTech at Jumia:\nWe are a Tech Driven company with an Innovative spirit. At Jumia Tech, you will work under the most updated technologies and work methodologies, collaborating between multiple teams across disciplines - Business, Product and Engineering. We are great fans of Agile philosophy and we aim to keep things simple but smart and fast. Also, for Jumia, technology relates with improvement for our world. We see technology as something we need to put purpose into. Our mission is to leverage technology to improve everyday life in Africa and we do it by delivering convenient and affordable online services to consumers, helping them fulfill basic everyday needs. And while we’re present in Africa, we get to take African economy online, helping small and large businesses grow and reach new consumers. This is what drives our day to day decisions. :)\nWe are looking for great people to join our amazing teams and celebrate our achievements. At Jumia we work hard, but we do Tech With Purpose!\nWhat you will be doing:\n\nAs a Senior Backend Developer, you will be part of an agile Software Development Team and will be responsible for the full lifecycle of an application.\nYou will be working with a team of talented Engineers across geographies, and entrusted in defining the solution, leading the design, architecture and development of applications using Java and related technologies.\nYou will collaborate with the product team and stakeholders to translate product feature requirements into technical specifications, and will identify the best approach for large pieces of work that span multiple components and teams.\nYou will perform code reviews, provide feedback and guidance to your team, and ensure the overall quality and maintainability of the codebase, while focussing on optimizing the performance.\nYou will troubleshoot and resolve complex technical issues in highly distributed systems. You will also be mentoring your junior colleagues, and helping elevate the skills and developing the team, ensuring the team stays up to date and applies the new trends in the industry.\nAs an expert in the area, you will be the go-to person for big ideas and problem-solving. With your large expertise, we know that you'll add a lot of value to the team - be it by suggesting alternative methodologies that may be more efficient, actively improving the tooling to improve use cases, or even designing and developing a technical solution or new processes to create robust, reliable and scalable systems.\nYou can expect to use cutting-edge technologies to deliver amazing value and the best product to our customers while scaling our platform to meet the demands of worldwide markets. You will be required to program well-designed, testable, efficient code to solve business needs, as well as test and document the implemented solutions.\nWhat we are looking for:\nTechnical Skills:\n8+ Years of Experience in hands-on development in Java (preferably 8+) and related frameworks or similar OOP languages\nExperience in working with high concurrency, highly transactable, high available platforms\nAcquainted with building testable code, unit tests and/or integration tests\nKnowledgeable of software design and architecture patterns\nKnowledgeable of SQL and relational databases\nExperience with code versioning tools\nExperienced in some of the following technologies: Maven, Gradle, Hibernate, Kafka, RabbitMQ, Redis, Prometheus, Docker, Kubernetes, SonarCube, Jenkins\nFamiliarity with APIs, Event Driven Architecture, Microservices, Dockers & Containers\nDevSecOps mindset\nAware of fault-tolerance and secure programming concepts\nExperienced in some of the following concepts: message queuing, caching, NoSQL, SOA, CI/CD, application and system monitoring\nExperienced working with Scrum processes\nSoft Skills:\nFluent in English, strong communication and collaboration abilities\nAbility to drive consensus in a multi disciplinary environment\nCritical thinking and Problem solving capabilities\nAnalytical and troubleshooting skills\nBeing resilient and Challenging the status quo\nExtreme accountability and drive for results\nWe Offer:\nA unique experience in an entrepreneurial, yet structured environment\nA unique opportunity of having strong impact in building the African e-commerce sector\nThe opportunity to become part of a highly professional and dynamic team\nAn unparalleled personal and professional growth as our longer term objective is to train the next generation of leaders\n\nPlease ensure to only apply for jobs with Jumia through our official website.\nJumia will never charge you a fee to apply for a job: be wary of websites that claim to help you apply for a Jumia job or that charge a fee to get you a job.",
        "job_url": "https://ng.indeed.com/rc/clk?jk=854ffddb63f8ad67&fccid=3e9359119b425c78&vjs=3"
    },
    {
        "job_title": "PHP Software Engineer - Jumia (Full Time)",
        "company_name": "Jumia",
        "company_location": "Nigeria",
        "job_content": "About Jumia:\nJumia is the leading pan-Africa e-commerce platform. Founded in 2012, Jumia’s mission is to improve the quality of everyday life in Africa by leveraging technology to deliver innovative, convenient and affordable online services to consumers, while helping businesses grow as they use our platform to reach and serve consumers.\nOur platforms among others, comprises of:\nMarketplace, where we integrate with our sellers and manage products;\nMall, which is our core e-com platform that enables customers to buy products;\nLogistics service, which enables the shipment and delivery of packages from sellers to consumers, and our external clients;\nPayment service, which facilitates transactions among participants active on our platform in our markets.\nThrough our online platforms, consumers can access a wide range of physical and digital goods and services, fashion, electronics, beauty products and also hotel and flight bookings or restaurant delivery.\nWith over 5,000 employees in more than 10 countries in Africa, Jumia is led by top talented leaders offering a great mix of local and international talents and is backed by very high-profile shareholders. Jumia is committed to creating a sustainable impact for Africa. Jumia offers unique opportunities in a vibrant and booming environment, creating new jobs and skills, and empowering a new generation.\nTech at Jumia:\nWe are a Tech Driven company with an Innovative spirit. At Jumia Tech, you will work under the most updated technologies and work methodologies, collaborating between multiple teams across disciplines - Business, Product and Engineering. We are great fans of Agile philosophy and we aim to keep things simple but smart and fast. Also, for Jumia, technology relates with improvement for our world. We see technology as something we need to put purpose into. Our mission is to leverage technology to improve everyday life in Africa and we do it by delivering convenient and affordable online services to consumers, helping them fulfill basic everyday needs. And while we’re present in Africa, we get to take African economy online, helping small and large businesses grow and reach new consumers. This is what drives our day to day decisions.\nWe are looking for great people to join our amazing teams and celebrate our achievements. At Jumia we work hard, but we do Tech With Purpose!\nWhat you will be doing:\n\nAs a Senior PHP Developer, you will be part of an agile Software Development Team and will be responsible for the full lifecycle of an application.\nYou will be working with a team of talented Engineers and entrusted in defining the solution, leading the design, architecture and development of web applications using PHP and related technologies;\nYou will collaborate with the product team and stakeholders to translate product feature requirements into sechnical specifications, and will identify the best approach for large pieces of work that span multiple components and teams;\nYou will perform code reviews, provide feedback and guidance to your team, and ensure the overall quality and maintainability;\nYou will be instrumental in optimizing performance of the application by implementing caching mechanisms, database optimizations and applicable code refactoring;\nYou will troubleshoot and resolve complex technical issues in highly distributed systems;\nYou will also be mentoring your junior colleagues, and helping elevate the skills and developing the team, ensuring the team stays up to date and applies the new trends in the industry;\nAs an expert in the area, you will be the go-to person for big ideas and problem-solving;\nWith your large expertise, we know that you'll add a lot of value to the team - be it by suggesting alternative methodologies that may be more efficient, actively improving the tooling to improve use cases, or even designing and developing a technical solution or new processes to create robust, reliable and scalable systems;\nYou can expect to use cutting-edge technologies to deliver amazing value and the best product to our customers while scaling our platform to meet the demands of worldwide markets;\nYou will be required to program well-designed, testable, efficient code to solve business needs, as well as test and document the implemented solutions.\nWhat we are looking for:\nTechnical Skills:\n8+ Years of Experience in web application development in PHP, with a strong understanding of PHP language and frameworks (e.g. Zend Expressive, Laravel, Symfony)\nAcquainted with building testable code, unit tests and/or integration tests\nKnowledgeable of software design and architecture patterns\nStrong knowledge of relational databases (especially MySQL) and SQL, performance tuning and optimizations\nExperience in working with high concurrency, highly transactable, high available platforms\nExperience in migration of legacy systems\nExperience in API integrations, web services and third party libraries\nExperience with code versioning tools\nDevSecOps mindset\nAware of fault-tolerance and secure programming concepts\nExperienced in some of the following concepts: message queuing, caching, NoSQL, SOA, CI/CD, application and system monitoring\nExperienced working with Scrum processes\nExperience of working with Gearman would be a plus\nProficiency in other front end technologies like html, css, js is a plus\nSoft Skills:\nFluent in English, strong communication and collaboration abilities\nAbility to drive consensus in a multi disciplinary environment\nCritical thinking and Problem solving capabilities\nAnalytical and troubleshooting skills\nOpenness to handling both legacy systems and greenfield projects\nBeing resilient and Challenging the status quo\nExtreme accountability and drive for results\nWe Offer:\nA unique experience in an entrepreneurial, yet structured environment\nA unique opportunity of having strong impact in building the African e-commerce sector\nThe opportunity to become part of a highly professional and dynamic team\nAn unparalleled personal and professional growth as our longer term objective is to train the next generation of leaders\n\nPlease ensure to only apply for jobs with Jumia through our official website.\nJumia will never charge you a fee to apply for a job: be wary of websites that claim to help you apply for a Jumia job or that charge a fee to get you a job.",
        "job_url": "https://ng.indeed.com/rc/clk?jk=3312509da587b327&fccid=3e9359119b425c78&vjs=3"
    },
    {
        "job_title": "Backend Developer",
        "company_name": "The Job Factors NG",
        "company_location": "Lagos",
        "job_content": "Job Profile Sheet\nTitle of position: Back-end Developer\nCore purpose of the Job: An analytical result driven back – end developer who will be responsible for developing high-quality applications. They will also be responsible for designing and implementing testable and scalable code.\nKey Performance Areas:\nDevelop quality software and web applications\nAnalyze and maintain existing software applications\nDesign highly scalable, testable code\nDiscover and fix programming bugs.\nCompetencies\nSkills:\nDevelopment experience with C# programming language, .NET Framework, .NETCore.\nMicrosoft SQL Server database skills.\nAbility to work closely with Engineers and designers.\nExperience working on B2C products.\nExcellent verbal and written communication skills. Focus on technical documentation.\nFull stack understanding of web API/database development concepts and patterns.\nExperience with working with API Documentation.\nAttitude: Must be Friendly, honest, transparent and diligent in all dealings.\nPersonnel & Quality Standards\nQualification (s) Relevant Degree.\nJob Specification Previous experience in same or similar role.\n(Experience & Technical background)\n3 to 4 years minimum work experience.\nJob Types: Full-time, Permanent\nPay: ₦350,000.00 - ₦400,000.00 per month\nApplication Deadline: 07/12/2023\nExpected Start Date: 04/12/2023",
        "job_url": "https://ng.indeed.com/company/The-Job-Factors-NG/jobs/Back-End-Developer-c3c7cab12614d512?fccid=886416fa16bb4076&vjs=3"
    },
    {
        "job_title": "Staff Wells Engineer",
        "company_name": "Shell",
        "company_location": "Port Harcourt",
        "job_content": "Shell Nigeria is looking for the following:\nStaff Wells Site Supervisor\nStaff Wells Engineer Drilling\nStaff Wells Engineer (CWI)\nWhat’s the role?\nStaff Wells Site Engineer:\nSupervise drilling and completion operations on the rig in accordance with the drilling program and the SPDC HSSE and operational policies standards and procedures with the objective of:\nAchieving Goal Zero\nDelivering on promises against 1) Schedule, 2) Cost and 3) Well proposal for reserves and production potential\nRaising performance to TQ\nAccountabilities:\nAchieve goal zero on his rig by enforcing the applicable HSE rules and procedures, intervening in case of breech, working the rig HSE case, ensuring timely reporting and investigation of incidents, reinforcing Hazard identification and prevention, building staff HSE awareness\nAlways maintain well control by ensuring personnel is conversant with kick detection techniques and well closing in procedures and BOP equipment is certified maintained and tested.\nDelivering wells on time and to the required quality standards. Track daily costs and take necessary action to deliver well within budget\nTranslate drilling program into detailed instructions for contractors and service companies. Compiling daily drilling report and other required specific reports\nCoordinate activities of various contractors and service companies intervening on the rig site\nIdentifying ideas to improve performance and communicating them to the office team for inclusion in drilling programs.\nTimely ordering of services and equipment and QA/QC when delivered on site and Coaching and mentoring across different rig units as may be required.\nStaff Wells Engineer Drilling:\nResponsible for the design, planning, and supervision of Drilling, completion and well intervention operations, with the full integration of the relevant asset teams. Preparation of detailed cost and time estimates, tracking of relevant metrics during job execution, after action reviews (AAR) documentation, well handover to Exploration, production, and developing subsequent improvement plans.\nAccountabilities:\nHSSE – Integrate HSSE in the design, programming, and execution. Actively promote HSSE and Sustainable Development (SD) in all activities and ensure compliance with business principles.\nRegulatory – ensure all Well Notifications, Combined Operations Notifications, Regulatory Permits, etc are all in place and correct prior to commencement of operations.\nMentor junior staff in all aspects of Well engineering design and operations, and in interaction with other asset teams.\nSupport and foster relationships with other asset teams including subsurface, production, facilities, and construction. Support engagements with JV partners where applicable and the development and analysis of competitive benchmarking to drive operational excellence.\nLead the technical and HSSE management of relevant service provider contracts and support the contracting and procurement strategy. Collaborate with contractors regarding performance, future variances, etc. as needed.\nActively drive the identification, development, and implementation of new technologies and the opportunities to optimize field operations.\nDevelop annual personal performance review/management documents including performance contracts, individual development plans (IDPs) and goals and performance appraisals (GPAs)\nStaff Wells Engineer (CWI):\nTo provide technical expertise and operational support (including System Integration Testing of Surface Wellhead and Xmas Tree systems for Wells Operations.\nAccountabilities:\nProviding exemplary HS&E leadership to ensure that corporate HS&E policies and initiatives are disseminated and applied to all Wells Wellhead and Tree system integration testing operations.\nAct as the focal point with our suppliers for scheduling, management, refurbishment and certification of Surface Tress, Wellhead Equipment and Surface intervention systems.\nAttend morning Rig calls on a daily basis.\nProvide technical input and support, both routine and emergency, on all aspects of Wellhead and Xmas Tree systems to Wells teams during drilling, completion and intervention operations.\nRig start up - organise and compile accurate Rig survey reports and make recommendations with regard to equipment handling, location and installation\nPlanning and scheduling of Tree system refurbishments to ensure equipment is available for installation to meet project schedule\nDevelop and agree SIT procedures for all Wellhead and Xmas Tree systems such that the completion of the test programme delivers technical integrity assurance of all system interfaces prior to shipment for installation.\nDeliver Plan and schedule for SIT activities to ensure equipment is available for installation to meet project schedule.\nLiase with Design Engineers to ensure Surface Wellhead and Xmas Tree specifications and associated SIT’s meet specific project requirements.\nProduce accurate, detailed SIT cost estimates using approved cost estimating systems and be responsible for accurate cost tracking during SIT operations.\nApply STL principles and tools to SIT planning and execution in order to drive improved performance\nManagement of contracts in SAP for all SIT related activities, including the raising of purchase orders, call off’s and service entries.\nCall off and co-ordinate multi-disciplined team of contractors to provide all services and equipment to perform SIT’s as per the agreed procedure.\nAttend and provide input at CWOP’s, DWOP’s and IWOP’s.\nProvide input and review Drilling, Completion, and Intervention and Abandonment programs.\nReview and approve Operations and Maintenance manuals,\nReview and approve new and repaired equipment FAT procedures.\nWork with front end team to ensure all proposed Wellhead and Xmas tree designs adjustments are fit for purpose.\nWhat we need from you?\nStaff Wells Site Supervisor\nA professional engineer with a university degree in a relevant engineering or science discipline.\nA minimum of 8 years’ experience in Well Engineering and Drilling activities. Four of which should have been spent as a Drilling Supervisor.\nIWCF certification is an added advantage\nGood supervisory skills, with sound knowledge of drilling practices and well control principles and techniques enhanced by strong interpersonal skills\nGood analytical, communication and writing skills, with PC fluency and familiarity with drilling engineering software.\nExcellent proficiency in English language, both in speech and in writing\nWilling to work on rotations to remote field locations\nStaff Wells Engineer (Drilling)\nTechnical Skills: A graduate degree in engineering or science\nMinimum of Eight (8) years experience in Well Engineering and design three of which should have been spent as a drilling Engineer.\nA demonstrable experience in Shallow water and onshore drilling and completions design\nDesign Experience with use of Wells Design tools such as WELLCAT, WELLPLAN, COMPASS etc.\nPossession of IWCF could be an added advantage\nCommercial skills: Strong management skills, proponent of Strategic Cost Leadership, deep understanding of commercial implications of emerging ways of working, techniques and technologies. Able to bench mark on local and global scale.\nJV Relations and budget management, cost recovery.\nPeople Skills: Exceptional relationship skills and ability to influence at all levels.\nBe responsible for own development and will execute a personal development plan agreed with the Well Ops Team Leader- Skilled in presentation and communications\nAbility to work and manage in a diverse, multi-cultural environment.\nmaximum value to the assigned asset whilst maintaining HS&E standards.\nStaff Wells Engineer CWI\nHave a Higher National or equivalent qualification in Mechanical Engineering or a similar technical or scientific discipline.\nHave a minimum of eight year’s well engineering experience, including extensive experience and knowledge of Surface Tree and Wellhead systems.\nHave an understanding of control systems and Surface intervention Systems.\nBe responsible for own development and will execute a personal development plan in conjunction with line supervisor and capability team\nMaintain minimum safety certification to satisfy the requirements of the position. (Offshore survival, medical etc.)\nScam Warning\nShell does not request monetary payments (e.g. insurance policy, visa/work permit, HUET or HSSE training, special job offer, etc.) for employment. Individuals who are interested in opportunities within the Shell Group will find open positions listed on the company websites www.shell.com/careers when available.\nShell does not make use of employment forms; neither does the Company process CVs that have not been submitted through the proper websites: www.shell.com/careers. All successful applicants who receive an offer of employment from Shell would have been required to go through a formal and transparent recruitment process.\nTo learn more about Shell’s recruitment process please visit our website www.shell.com/careers.\nShell is an Equal Opportunity Employer.\nCOMPANY DESCRIPTION\nAn innovative place to work\nThere’s never been a more exciting time to work at Shell. Everyone here is helping solve one of the biggest challenges facing the world today: bringing the benefits of energy to everyone on the planet, whilst managing the risks of climate change.\nJoin us and you’ll add your talent and imagination to a business with the power to shape the future – whether by investing in renewables, exploring new ways to store energy or developing technology that helps the world to use energy more efficiently.\nAn inclusive place to work\nTo power progress together, we need to attract and develop the brightest minds and make sure every voice is heard. Here are just some of the ways we’re nurturing an inclusive environment – one where you can express your ideas, extend your skills and reach your potential…\nWe’re creating a space where people with disabilities can excel through transparent recruitment process, workplace adjustments and ongoing support in their roles. Feel free to let us know about your circumstances when you apply, and we’ll take it from there.\nWe’re closing the gender gap – whether that’s through action on equal pay or by enabling more women to reach senior roles in engineering and technology.\nWe’re striving to be a pioneer of an inclusive and diverse workplace, promoting equality for employees regardless of sexual orientation or gender identity.\nWe consider ourselves a flexible employer and want to support you finding the right balance. We encourage you to discuss this with us in your application.\nA rewarding place to work\nCombine our creative, collaborative environment and global operations with an impressive range of benefits and joining Shell becomes an inspired career choice.\nWe’re huge advocates for career development. We’ll encourage you to try new roles and experience new settings. By pushing people to reach their potential, we frequently help them find skills they never knew they had, or make career moves they never thought possible.",
        "job_url": "https://ng.indeed.com/rc/clk?jk=8f93224bf5a5a56e&fccid=167aa4ca2fe7d8e6&vjs=3"
    },
    {
        "job_title": "Software Support Engineer (Kenya/Nigeria)",
        "company_name": "Seeq Corporation",
        "company_location": "Nigeria",
        "job_content": "Seeq makes data analytics software for a big market that’s often overlooked by tech companies: industrial process data. Think pharmaceutical manufacturers, wind farms, and energy companies with tons of equipment and sensors.\nOur company is 100% remote and proud of it. We use a variety of collaboration tools, like Zoom, Slack, and our homegrown Qube Virtual Office, which makes us feel like we’re in the same building together. We have a wonderful team of kind-hearted, talented engineers that love to collaborate, teach each other new tricks, and build products that exceed our customers’ expectations.\nThe core of our product is a full-featured calculation engine that can perform complex math and execute machine learning algorithms on streaming time-series data.\nKey Responsibilities\nAs a Software Support Engineer (SSE) working from either Kenya or Nigeria, you’ll join our growing team to help our customers install our software (or, in the case of our cloud offering, deploy to one of our cloud-hosted environments), connect to their data sources, integrate their identity/authentication infrastructure, and upgrade to new versions. You will interact with customers directly (usually over Zoom web conferencing) to troubleshoot technical issues with our software and issues in the customers' environment (firewalls, third-party authentication, and general IT issues affecting our software deployment). You will be a member of the product development team and will have a strong voice in shaping development efforts to improve customer satisfaction and mitigate common pain points.\nQualifications\nSeeq prefers to emphasize talent, capacity to contribute, and passion, but the ideal candidate is likely to have many of the following characteristics:\nCandidate is motivated by solving customer problems with a knack for tenaciously digging in to find the real root cause.\nResponsive and communicative with an enthusiastic drive to help customers even during off-hours.\nFamiliarity with Linux and Windows\n- we deploy on both platforms. You are familiar with either AWS or Azure cloud environments.\nCandidate is disciplined with high attention to detail and enjoys sleuthing through multiple logs to tie together theories.\nQuick learner known for suggesting new ideas and raising the bar for the whole team.\nCapable of deep investigation of issues using standard system tools like Task Manger, Process Explorer and even Wireshark or other Windows Sysinternal power tools. Experience troubleshooting networking technologies such as TCP/IP, HTTP(S), and Ethernet.\nBachelor's or Associate Degree in Computer Science, Information Technology / Information Systems or related field.\nPrevious startup experience is a plus.\n\n\nWe are organized as a virtual company with a headquarters in Seattle, WA. We use state-of-the-art online collaboration tools for development and corporate functions. Employees can be based virtually anywhere as long as they have access to a good office environment, high-bandwidth connectivity (at least 3 Mbit uplink and 30 Mbit downlink).\nThe best applicants are ones who include cover letters explaining how their backgrounds, experiences, and interests match Seeq's position description. Please let us know how you will contribute to our mission and our future success.\nAbout Seeq\nSeeq is a remote-first (only) company founded by serial entrepreneurs. Our executive team and board of directors have extensive experience with successful startup ventures in high-growth environments.\nWe are founded on the idea that companies need better solutions for quickly and easily getting business insight from their industrial process data. Our mission is to provide software and services that convert that data into meaningful information that the business can use to improve profitability.\nWe use the best modern big data technologies to bring industrial process data into the business decision process.\nOur company is virtual, meaning that everyone works from a location of their choosing. There’s no commute and no cubicle! We are serious about recruiting and retaining the best teammates. We think there are tons of benefits to working on exciting technology with a cohesive team and the flexibility to work from anywhere.\nWe have a wonderful, kind-hearted, talented team that loves to collaborate, lead by example, and love to exceed our customers’ expectations. We are certified as a Great Place to Work, Emerging Startup, Technology Fast 500, and Inc. Magazine's Best Places to Work.\nThe Perks of Working at Seeq\nCompetitive salary plus equity incentives\nImportant benefits like this (because we want you to be happy):\nFreedom PTO\n5-weeks paid Seeq family leave\nInternet and mobile phone reimbursement\nVacation bonus program\nFringe Benefits\nGenerous home office allowance\nThe best co-workers (we've analyzed the data, so we know it's true)\nPet-friendly workspace (your dog will be so happy to have you home)\nLoving your job!\nSeeq provides equal employment opportunities (EEO) to all employees and applicants for employment without regard to race, color, religion, sex, national origin, age, disability or genetics.",
        "job_url": "https://ng.indeed.com/rc/clk?jk=ccea21bf88a14601&fccid=2863b31e9b256ba4&vjs=3"
    },
    {
        "job_title": "Backend Software Engineer, Nigeria - Remote",
        "company_name": "Branch International",
        "company_location": "Nigeria",
        "job_content": "Branch Overview\nImagine a world where every person has improved access to financial services. People could start new businesses, pay for their children’s education, cover their emergency medical bills – the possibilities to improve life are endless.\nBranch is a global technology company revolutionizing financial access for millions of underserved banking customers today across Africa and India. By leveraging the rapid adoption of smartphones, machine learning and other technology, Branch is pioneering new ways to improve access and value for those overlooked by banks. From instant loans to market-leading investment yields, Branch offers a variety of products that help our customers be financially empowered.\nBranch’s mission-driven team is led by the co-founders of Kiva.org and one of the earliest product leaders of PayPal. Branch has raised over $100 million from leading Silicon Valley investors, including Andreessen Horowitz (a16z) and Visa.\nWith over 32 million downloads, Branch is one of the most popular finance apps in the world.\n\nAbout the role\nBranch launched in Nigeria in 2017 and has seen rapid adoption and growth. In 2021, we plan to grow our engineering team in Nigeria significantly. As part of this team, you will work closely with our global engineering team (distributed across three continents) to strengthen the capabilities of our existing product and build out new products for Branch. Example projects include: Building new functionality for our Credit and Wallet products; helping improve the reliability of our core payments and banking systems; architecting data pipelines and machine learning models for credit underwriting; and more.\nAs a company, we are passionate about our customers, fearless in the face of barriers, and driven by data. As an engineering team, we value bottom-up innovation and decentralized decision-making. We believe the best ideas can come from anyone in the company, and we are working hard to create an environment where everyone feels empowered to propose solutions to the challenges we face. We are looking for individuals who thrive in a fast-moving, innovative, and customer-focused setting.\nHere are some things you'll do\nBuild out backend functionality for existing and new product lines such as Credit, Wallet, Bill Pay, and others.\nIntegrate with various third-party systems, including payment systems, identity providers, and messaging platforms.\nScale our backend services and pipelines to ever-growing levels of traffic and complexity.\nHelp build flexible and easy-to-use tools used by our operations teams to handle customer inquiries and other business processes.\nMinimum Requirements\nYou have strong experience (2+ years) of building backend software for web-based or mobile products.\nYou are an excellent collaborator and communicator. You listen to others and seek to understand, but aren’t afraid to speak your mind and debate in a respectful manner when you disagree.\nYou are excited by the prospect of working in a distributed team and company, working with teammates from all over the world.\nPreferred Requirements\nYou have a solid foundation in computer science fundamentals, distributed systems, data storage, and agile development methodologies.\nYou are pragmatic and combine a strong understanding of technology and product needs to arrive at the best solution for a given problem.\nYou are highly entrepreneurial and thrive in taking ownership of your own impact. You proactively identify problems and propose solutions.\n\nBenefits of Joining\nWork in a mission-driven, global, fast-paced and entrepreneurial environment\nCompetitive salary and equity package\nA collaborative and flat company culture\nRemote first, with the option to work in-person occasionally\nFully paid life and health insurance benefit with Axa Mansard (Platinum plan)\nWork-life balance is not a myth, we offer a generous paid leave policy comprising; 28 days annual leave, 30 days sick leave, bereavement leave\nFully paid parental leave - 6 months maternity and 3 months paternity leave\nPension Benefit\nMonthly WFH stipend alongside a one time home office set-up budget\nWe believe learning should never stop and so we provide a $500 stipend annually towards learning and development irrespective of role, title or tenure\nDiscretionary trips to our offices across the globe, with global travel medical insurance\nTeam meals and social events (Hybrid for now)\nFlexible working hours\nOpportunity to work and interact with a global team\n\nWe’re looking for more than just qualifications - so if you’re unsure that you meet the criteria, please do not hesitate to apply!\nBranch International is an Equal Opportunity Employer. The company does not and will not discriminate in employment on any basis prohibited by applicable law.\n\nLocation\nThis is a remote role. We are open to working with you provided you are able to work within the West African Time (WAT) zone.\n\nsATwex1bv6",
        "job_url": "https://ng.indeed.com/rc/clk?jk=f284fa5aba1a8b2d&fccid=693e4534a328a646&vjs=3"
    },
    {
        "job_title": "Software Engineer (Python/Django)",
        "company_name": "Ayulla Inc.",
        "company_location": "Nigeria",
        "job_content": "Software Engineer (Python/Django)\nAyulla Inc.\nSoftware & Data\nRemote (Work From Home) Full Time\nIT & Telecoms NGN 250,000 - 400,000\nNew Featured\n1 week ago\nJob Summary\nWe are looking for a talented Python/Django backend engineer to join our growing engineering team who is responsible for developing and maintaining various software products in our portfolio. As a backend software engineer at Ayulla, you will be responsible for writing, testing, and debugging new and existing codes.\nMinimum Qualification: Degree\nExperience Level: Mid level\nExperience Length: 2 years\nJob Description/Requirements\nAyulla is a tech startup driven by the unending effort to design and deploy massive software that we believe will be a major landmark in its class\n\nResponsibilities:\n\nDevelop well-designed, scalable, and robust software to a high-quality standard\nDevelop flowcharts, layouts, and documentation to identify requirements and solutions\nIntegrate software components into a fully functional software system\nDocument and maintain software functionality\nTroubleshoot, debug, and upgrade existing systems\nStay up-to-date with the latest and emerging technologies\n\nRequirements:\nBachelor's degree or higher in Computer Science, Software Engineering, or any related field, or equivalent field experience\nAt least 1 year of experience working in Python, Django, and Django REST Framework\nAt least 1 year of hands-on experience in developing web applications\n2 years of working experience\nStrong computer science fundamentals and problem-solving\nGood communication and collaboration skills\n\nNote: A Bachelor's degree or higher in Computer Science, Software Engineering, or any related field could be an advantage in this role, it is not a requirement. A significant field experience developing and deploying software solutions is highly valued and in most cases considered superior to a Bachelor's degree in any field of computing.",
        "job_url": "https://ng.indeed.com/rc/clk?jk=2cb58a1fd6296a0f&fccid=0dbf2396a49ea295&vjs=3"
    },
    {
        "job_title": "NETWORK IMPLEMENTATION AND SUPPORT ENGINEER",
        "company_name": "DynamicPlus",
        "company_location": "Lagos",
        "job_content": "JOB DESCRIPTION\n· Design, Develop and modify the technical network solution while ensuring the integrity of service delivery\n· Create, modify, and maintain process engineering designs (work flows and documentation)\n· Manage VPN requests for existing and new customers ensuring timely delivery of hardware.\n· Configure and install various network devices and services (e.g., Routers, Switches, Firewalls, WiFI Access Points, WiFi Controllers, Linux Servers, Load Balancers, VPN, QoS)\n· Network Implementation and support of multi-vendor products and environments – Cisco, Aruba/HP, Cisco Meraki, Ruckus, Brocade, Hauwei, Mikrotik, Fortinet, Juniper, Cambium, Ubiquiti.\n· Network Implementation and Support of several services – WiFi - 802.11a, 802.11n, 802.11ac, 802.11ax environments, VOIP, Radius, 802.1x, Site-to-Site VPNs, IPTV & Multicast routing, Payment Management Systems, etc.\n· Network Implementation and support of Linux-based systems – Red Hat, Ubuntu, Kali, Debian, Centos, Android, etc.\n· Perform network maintenance and system upgrades including service packs, patches, hot fixes and security configuration.\n· Monitor performance and ensure system availability and reliability.\n· Monitor system resource utilization, trending, and capacity planning\n· Design and deploy functional networks using various networking methodologies – LAN, WLAN, WAN, VLANs, STP, DHCP, DNS, ACLs, etc.\n· Diagnose and troubleshoot software and hardware problems and help our customers install applications and programs.\n· Manage multiple, simultaneous customer projects of varying complexities while minimizing network impact during change/maintenance windows.\n· Identifies new service areas through field surveys and coordinates meetings with stakeholders, including developers and customers, to determine infrastructure requirements for services availability\n· Implement systems solutions selected by clients including systems repairs, expansions & upgrades\n. Act as technical advisor to commercial discussions such as proposed solutions sales & contract renewals and assist with promoting and implementing all systems revenue programs\n· Maintain and service repair needs on designated equipment/systems\n· Maintain complete technical documentation\n· Suggest improvements to network performance, capacity and scalability\n·CORE COMPETENCE\n· Ability to convey network concepts and issues to both technical and non-technical audience.\n· Knowledge of best practices around management, control, and monitoring of server infrastructure.\n· Familiarity with backup and recovery software and methodologies.\n· Experience with network diagnostic, monitoring and analysis tools\n· Multicast Routing Networks\n· Experience of building and maintaining full range of both Cisco and Juniper devices, including Firewalls and perimeter security products\n· Solid background in firewalls and security solutions - Fire power, Forescout, Fortigate, NGX, Palo Alto, etc\n· Good understanding of Linux Systems administration – Red Hat, Ubuntu, Kali, Debian, Centos, Android, etc.\n· Solid IT Networking Troubleshooting skills using various tools and methodologies – Wireshark, TCPdump, Ethtool, Pings, Traceroute, SSH, etc.\nREQUIREMENTS\n· Minimum of 3 years’ relevant experience in NETWORK IMPLEMENTATION AND SUPPORT in an IT based solutions environment\n· Professional certification (e.g. CCNA, CCNP, CCDP, CCIE) is Compulsory\n· Professional Qualifications in Firewall/Security-related\n· Solid understanding of network operating systems (JUNOS, Cisco IOS)\n· Must have a University degree/HND\nJob Type: Full-time\nSalary: ₦300,000.00 - ₦400,000.00 per month\nAbility to commute/relocate:\nLagos: Reliably commute or planning to relocate before starting work (Required)\nApplication Deadline: 24/09/2023\nExpected Start Date: 24/09/2023",
        "job_url": "https://ng.indeed.com/company/DynamicPlus/jobs/Network-Engineer-0e4f3bb86611309a?fccid=001828183e77bcfd&vjs=3"
    },
    {
        "job_title": "Java Software Engineer",
        "company_name": "Interswitch",
        "company_location": "Lagos",
        "job_content": "Interswitch Group is an Africa-focused integrated digital payments and commerce company that facilitates the electronic circulation of money as well as the exchange of value between individuals and organizations on a timely and consistent basis. The company started its operations in 2002 as a transaction switching and electronic payments processing company. It has progressively evolved into an integrated payment services company and delivers innovative payment products and transactional services throughout the African continent. Interswitch offers unique career opportunities for individuals capable of playing key roles and adding value in an innovative and fun environment.\nWe are recruiting to fill the position below:\nJob Position: Java Software Engineer\nJob Location: Lagos (Hybrid)\nTime Type: Full time\nRole Description\nThe Java Software Engineer will be responsible for designing, developing, and maintaining Java-based software applications.\nThe role involves developing high-quality, reliable, and scalable software and collaborating with cross-functional teams to identify, troubleshoot, and fix software issues.\nThis is a full-time hybrid role located in Lagos, with flexibility for some remote work.\nQualifications\nBachelor's Degree in Computer Science or a related field\nExperience in the fintech industry is a plus\nStrong skills in Software Development, Microservices, and Programming\nExperience in designing and implementing scalable software architecture\nKnowledge of Agile and Scrum methodologies\nProficiency in Spring Framework and Java programming language\nExperience in developing web services and RESTful APIs\nExcellent problem-solving and analytical skills\nStrong communication and interpersonal skills.",
        "job_url": "https://ng.indeed.com/rc/clk?jk=12096be3819d2516&fccid=26fb32bc1ea456eb&vjs=3"
    },
    {
        "job_title": "Software Engineer, Backend",
        "company_name": "Sticker Mule",
        "company_location": "Nigeria",
        "job_content": "S\nSoftware Engineer, Backend\nSticker Mule\nEngineering & Technology\nRemote (Work From Home) Full Time\nIT & Telecoms USD Less than 100\nNew\nToday\nJob Summary\nWe are looking to hire a Software Engineer, Backend who will Improve and expand our GraphQL APIs and as well migrate a large Rails code base to NodeJS services\nMinimum Qualification: Others\nExperience Level: Senior level\nExperience Length: 5 years\nJob Description/Requirements\nJob Responsibilities\nImprove and expand our GraphQL APIs\nMigrate a large Rails code base to NodeJS services\nMaintain optimal back-end performance\n\nJob Requirements\nDocker\nRuby\nRails\nTypeScript\nNodeJS\nGraphQL\nPostgres\nRedis\nFamiliarity with React\nExcellent communication skills (English)\nDegree in Computer Science or equivalent practical experience",
        "job_url": "https://ng.indeed.com/rc/clk?jk=4b5b399cecd469fd&fccid=8363d1ab1997f5d7&vjs=3"
    },
    {
        "job_title": "Transmission Engineer",
        "company_name": "BashleeNG",
        "company_location": "Abuja",
        "job_content": "One of our clients in the Telecom industry is urgently recruiting for a TRANSMISSION ENGINEER. The ideal candidate will be a professional who designs, installs, and maintains transmission systems that deliver electrical power from power plants to substations and customers.\nRESPONSIBILITIES:\nDeveloping and testing transmission systems according to specifications and standards\nTroubleshooting and resolving technical issues related to transmission equipment and components.\nPerforming preventive maintenance and repairs on transmission systems\nMonitoring and optimizing the performance and efficiency of transmission systems.\nCollaborating with other engineers, technicians, contractors, and clients on project planning and execution\nPreparing reports, documentation, and proposals for transmission projects\nAny other ad-hoc request from the client as the need requires.\nESSENTIAL REQUIREMENTS:\nMinimum of a bachelor’s degree in electrical engineering or a related field.\n5+ years’ experience in the field of electrical engineering or power systems.\nKnowledge of electrical principles, circuits, devices, and systems\nProficiency in using design software such as AutoCAD, MATLAB, Simulink, etc.\nAbility to read and interpret technical drawings, specifications, codes, and regulations.\nAnalytical and problem-solving skills\nCommunication and teamwork skills\nAttention to detail and quality.\nJob Type: Full-time\nSalary: ₦200,000.00 - ₦250,000.00 per month\nEducation:\nUndergraduate (Preferred)\nAbility to Commute:\nAbuja (Required)",
        "job_url": "https://ng.indeed.com/company/BashleeNG/jobs/Engineer-e6f3785f062e92a3?fccid=d3a435a10b419798&vjs=3"
    },
    {
        "job_title": "Senior Project Engineers",
        "company_name": "Elevated HR Limited",
        "company_location": "Lagos",
        "job_content": "JOB LOCATION: Warri\nEXPERIENCE LEVEL: Senior Level\nSECTOR: Engineering and Marine Technology\nEXPERIENCE LENGTH: 10 -15 Years\nJOB TYPE: Permanent\nJOB SUMMARY AND OVERVIEW\nOur client, a major player in the Oil and Gas sector and a provider of both offshore and onshore services across a broad stream is seeking to engage the services of Experienced Engineers.\nIn this role and under general supervision, successful candidates will be responsible for providing technical advice and guidance for all phases of assigned Engineering projects and programs, ensuring the successful conclusion of all phases within an appropriate time and at appropriate cost.\nJOB DESCRIPTION\nv Assists in the review, investigation, and development of appropriate recommendations regarding assigned Engineering projects.\nv Administers contracts with vendors for the provision of services and equipment\nv Performs other duties as required\nv Effectively communicate and collaborate with internal team members and occasionally contractors and clients.\nv Perform structural design and analysis calculations using governing codes and standards and structural analysis software.\nv Provide drawings and produce sketches of engineering designs.\nv Perform field activities such as observing and recording existing field conditions.\nv Conduct construction administration including responding to RFI’s. -Develop technical reports.\nv Research and analyze information of considerable difficulty and draw valid conclusions -Develop and maintain awareness of occupational hazards.\nSKILLS:\nv Experience with performing structural design and analysis calculations using governing codes and standards.\nv Experience with pipeline construction techniques such as welding, excavation.\nv Experience with drawing for own designs and produce sketches to incorporate in drawings by Designers/Drafters.\nv Strong leadership and exceptional project management skills\nv Excellent computer skills in Microsoft Suite.\nv Excellent written and verbal skills.\nv Skilled in following safety practices and recognizing hazards\nEDUCATIONAL BACKGROUND/QUALIFICATIONS:\nv Bachelor’s degree in mechanical, Civil/Structural Engineering, Electrical Engineering, or related degree with 10-15 years’ experience.\nv A minimum of eight (8) years’ experience as a pipeline engineer or a related position is required.\nv Knowledge of the principles and practices of Engineering.\nv An exceptional advantage is, should have worked on projects related to SHELL, ExxonMobil, Chevron, Total or any other with renowned international oil companies (IOCs).\nv Certified COREN will be an additional advantage.\nOTHERS:\n1. Must be willing to travel as may be required.\n2. Should be available to relocate to Warri.\n3. Must be able to work in a potentially stressful environment\nQualified and Experience candidates can also apply with updated CV at elevatedhrlimited@gmail.com with subject being, “Senior Project Engineers”.\nJob Type: Permanent\nSalary: ₦800,000.00 - ₦2,000,000.00 per month\nAbility to commute/relocate:\nLagos: Reliably commute or planning to relocate before starting work (Required)\nApplication Deadline: 05/11/2023",
        "job_url": "https://ng.indeed.com/company/Elevated-HR-Limited/jobs/Senior-Project-Engineer-b951bb58d0181788?fccid=4df35dca0b517222&vjs=3"
    },
    {
        "job_title": "Senior Fullstack Software Engineer",
        "company_name": "Buildas",
        "company_location": "Nigeria",
        "job_content": "B\nSenior Fullstack Software Engineer\nBuildas\nSoftware & Data\nRemote (Work From Home) Contract\nIT & Telecoms NGN 900,000 - 1,200,000\nNew\n6 days ago\nJob Summary\nJoin a venture-backed company revolutionizing tech collaboration across Asia and North America. We connect developers with cutting-edge projects across Asia and North America, fueling innovation and reshaping industries. Dive into a world where your skills meet limitless opportunities. Let's redefine tech execution together! We are seeking an experienced and talented Senior Full Stack Developer to join our dynamic team. In this role, you will be responsible for designing, developing, and maintaining full-stack applications. As a Senior Full Stack Developer, you will play a pivotal role in shaping the future of tech execution, contributing to projects that drive innovation across industries.\nMinimum Qualification: Others\nExperience Level: Senior level\nExperience Length: 7 years\nJob Description/Requirements\nResponsibilities:\nCollaborate with businesses to understand project requirements and technical specifications.\nCollaborate with cross-functional teams to define, design, and ship new features.\nLead and contribute to the development of scalable and high-performance web applications.\nParticipate in code reviews to maintain code quality and ensure best practices.\nStay up-to-date with industry trends and incorporate the latest technologies into our projects.\nTroubleshoot, debug, and optimize application performance.\n\nRequirements:\nProven experience as a Senior Full Stack Developer (minimum of 7 years development experience).\nStrong proficiency in front-end technologies such as HTML, CSS, and JavaScript.\nExtensive experience with server-side languages such as Node.js, Python, PHP, C#, or Java.\nExtensive experience with modern JavaScript frameworks (e.g., React, Angular, or Vue).\nExtensive experience with database technologies such as MySQL, MongoDB, or PostgreSQL.\nSolid understanding of web development architecture and RESTful APIs.\nExcellent problem-solving skills and attention to detail.\nStrong communication and collaboration skills.\n\nPreferred:\nBachelor's degree in Computer Science or a related field.\nExperience with cloud platforms (e.g., AWS, Azure, or Google Cloud).\nExperience with React Native, Dart or Flutter.\nKnowledge of containerization and orchestration tools (e.g., Docker, Kubernetes).",
        "job_url": "https://ng.indeed.com/rc/clk?jk=961abbe22a9ff22f&fccid=36fe13c5c26b9839&vjs=3"
    }
]